export const groups = [
    { id: 1, label: 'Дети 6-8 лет' },
    { id: 2, label: 'Дети 9-12 лет' },
    { id: 3, label: 'Дети 13-17 лет' },
    { id: 4, label: 'Взрослые' },
    { id: 5, label: 'Свободное плавание' },
];

export const times = [
    {
        id: 1,
        times: [
            { id: 1, label: '1 раз в неделю' },
            { id: 2, label: '2 раза в неделю' },
        ],
    },
    {
        id: 2,
        times: [
            { id: 1, label: '1 раз в неделю' },
            { id: 2, label: '2 раза в неделю' },
        ],
    },
    {
        id: 3,
        times: [
            { id: 1, label: '1 раз в неделю' },
            { id: 2, label: '2 раза в неделю' },
            { id: 3, label: '3 раза в неделю' },
        ],
    },
    {
        id: 4,
        times: [
            { id: 2, label: '2 раза в неделю' },
            { id: 3, label: '3 раза в неделю' },
        ],
    },
    {
        id: 5,
        times: false,
    },
];

export const shedules = [
    {
        title: 'Дети 6-8 лет, 1 раз в неделю',
        id: 1,
        times: 1,
        shedule: [
            {
                days: 'Воскресенье',
                items: [
                    { price: '1000 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00'] },
                    { price: '900 руб/занятие', time: ['16:45'] },
                ],
            },
        ],
    },
    {
        title: 'Дети 6-8 лет, 2 раза в неделю',
        id: 1,
        times: 2,
        shedule: [
            {
                days: 'Понедельник — Четверг',
                items: [
                    { price: '900 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00'] },
                    { price: '1000 руб/занятие', time: ['16:45', '17:30', '19:00'] },
                ],
            },
            {
                days: 'Понедельник — Среда',
                items: [{ price: '1000 руб/занятие', time: ['16:45'] }],
            },
            {
                days: 'Вторник — Пятница',
                items: [
                    { price: '900 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00'] },
                    { price: '1000 руб/занятие', time: ['16:45', '17:30', '19:00'] },
                ],
            },
            {
                days: 'Среда — Суббота',
                items: [{ price: '900 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00', '17:30', '19:00'] }],
            },
            {
                days: 'Суббота — Воскресенье',
                items: [{ price: '900 руб/занятие', time: ['11:30', '12:15', '13:00'] }],
            },
        ],
    },
    {
        title: 'Дети 9-12 лет, 1 раз в неделю',
        id: 2,
        times: 1,
        shedule: [
            {
                days: 'Воскресенье',
                items: [
                    { price: '1000 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00'] },
                    { price: '900 руб/занятие', time: ['16:45', '17:30', '18:15'] },
                ],
            },
        ],
    },
    {
        title: 'Дети 9-12 лет, 2 раза в неделю',
        id: 2,
        times: 2,
        shedule: [
            {
                days: 'Понедельник — Четверг',
                items: [
                    { price: '900 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00'] },
                    { price: '1000 руб/занятие', time: ['16:45', '17:30', '18:15', '19:00'] },
                ],
            },
            {
                days: 'Вторник — Пятница',
                items: [
                    { price: '900 руб/занятие', time: ['13:45', '14:30', '15:15', '16:00'] },
                    { price: '1000 руб/занятие', time: ['16:45', '17:30', '18:15', '19:00'] },
                ],
            },
            {
                days: 'Среда — Суббота',
                items: [
                    {
                        price: '900 руб/занятие',
                        time: ['13:45', '14:30', '15:15', '16:00', '16:45', '17:30', '18:15', '19:00'],
                    },
                ],
            },
            {
                days: 'Суббота — Воскресенье',
                items: [{ price: '900 руб/занятие', time: ['11:30', '12:15', '13:00'] }],
            },
        ],
    },
    {
        title: 'Дети 13-17 лет, 1 раз в неделю',
        id: 3,
        times: 1,
        shedule: [
            {
                days: 'Воскресенье',
                items: [
                    { price: '900 руб/занятие', time: ['17:30', '18:15', '19:00'] },
                    { price: '800 руб/занятие', time: ['19:45'] },
                ],
            },
        ],
    },
    {
        title: 'Дети 13-17 лет, 2 раза в неделю',
        id: 3,
        times: 2,
        shedule: [
            {
                days: 'Понедельник — Четверг',
                items: [
                    { price: '1000 руб/занятие', time: ['18:15'] },
                    { price: '900 руб/занятие', time: ['19:45'] },
                ],
            },
            {
                days: 'Вторник — Пятница',
                items: [
                    { price: '1000 руб/занятие', time: ['18:15'] },
                    { price: '900 руб/занятие', time: ['19:45'] },
                ],
            },
            {
                days: 'Вторник — Четверг',
                items: [{ price: '900 руб/занятие', time: ['20:30'] }],
            },
            {
                days: 'Среда — Суббота',
                items: [
                    {
                        price: '900 руб/занятие',
                        time: ['18:15', '19:45'],
                    },
                ],
            },
        ],
    },
    {
        title: 'Дети 13-17 лет, 3 раза в неделю',
        id: 3,
        times: 3,
        shedule: [
            {
                days: 'Понедельник — Среда — Пятница',
                items: [{ price: '900 руб/занятие', time: ['20:30'] }],
            },
        ],
    },
    {
        title: 'Взрослые, 2 раза в неделю',
        id: 4,
        times: 2,
        shedule: [
            {
                days: 'Вторник — Четверг',
                items: [
                    { price: '800 руб/занятие', time: ['7:45', '21:15'] },
                    { price: '900 руб/занятие', time: ['8:30'] },
                ],
            },
            {
                days: 'Суббота — Воскресенье',
                items: [{ price: '800 руб/занятие', time: ['20:30'] }],
            },
        ],
    },
    {
        title: 'Взрослые, 3 раза в неделю',
        id: 4,
        times: 3,
        shedule: [
            {
                days: 'Понедельник — Среда — Пятница',
                items: [
                    { price: '700 руб/занятие', time: ['7:45', '21:15'] },
                    { price: '800 руб/занятие', time: ['8:30'] },
                ],
            },
        ],
    },
    {
        title: 'Свободное плавание, занятия без тренера',
        id: 5,
        times: false,
        shedule: [
            {
                days: 'Будние дни',
                items: [
                    {
                        price: false,
                        time: [
                            '7:00',
                            '7:45',
                            '8:30',
                            '9:15',
                            '10:00',
                            '10:45',
                            '11:30',
                            '12:15',
                            '13:00',
                            '13:45',
                            '14:30',
                            '15:15',
                            '16:00',
                            '16:45',
                            '17:30',
                            '18:15',
                            '19:00',
                            '19:45',
                            '20:30',
                            '21:15',
                            '22:00',
                        ],
                    },
                ],
            },
            {
                days: 'Выходные дни',
                items: [
                    {
                        price: false,
                        time: [
                            '9:15',
                            '10:00',
                            '10:45',
                            '11:30',
                            '12:15',
                            '13:00',
                            '13:45',
                            '14:30',
                            '15:15',
                            '16:00',
                            '16:45',
                            '17:30',
                            '18:15',
                            '19:00',
                            '19:45',
                            '20:30',
                            '21:15',
                            '22:00',
                        ],
                    },
                ],
            },
        ],
    },
];
