<template>
    <div class="container faq">
        <h2 data-aos="fade-right" data-aos-once="true">Часто задаваемые <span class="blue">вопросы</span></h2>
        <client-only>
            <VueFaqAccordion data-aos="fade-up" data-aos-once="true" :items="questions" />
        </client-only>
    </div>
</template>

<script>
import VueFaqAccordion from 'vue-faq-accordion';
import './styles.css';

export default {
    name: 'Team',
    components: {
        VueFaqAccordion,
    },
    data() {
        return {
            showText: true,
            questions: [
                {
                    title: 'Что брать с собой на тренировки?',
                    value: '• плавки/купальник<br />• шапочка<br />• ‎очки<br />• тапочки<br />• ‎полотенце<br />• <b>‎хорошее настроение</b>',
                },
                {
                    title: 'Нужна ли справка в бассейн?',
                    value: '• для <b>детей до 12 лет</b> нужны справки педиатр + энтеробиоз <br />• для <b>детей старше 12 лет и взрослых</b> справка о том, что можно посещать бассейн. <br /> <br />Возьмите справку в районной поликлинике или частном медцентре.',
                },
                {
                    title: 'Нужно ли отдельно платить за посещение бассейна?',
                    value: 'В групповом формате – <b>нет</b>, аренда бассейна включена в стоимость.<br />На персональные тренировки проход <b>нужно покупать</b> во всех бассейнах, кроме <a href="/zelenograd"><b>Зеленоградского филиала</b></a> в 1801 (там проход уже включен в стоимость).<br/>Если же вы хотите поплавать самостоятельно – необходимо оплатить <b>только проход</b>.',
                },
                {
                    title: 'С какого возраста?',
                    value: 'У нас есть группы для деток <b>с пяти лет</b> в Зеленограде<br/>На свободное плавание можно <b>с 14 лет</b>',
                },
                {
                    title: 'Я боюсь воды. Что делать?',
                    value: 'Скорее приходи к нам на тренировки! <b>Любой страх можно побороть</b>. Главное обратиться к профессионалам.',
                },
                {
                    title: 'Через сколько занятий я/ребенок научимся плавать?',
                    value: 'Мы никогда не отвечаем на этот вопрос, потому что это зависит от многих обстоятельств. Кто-то поплывет через <b>две тренировки</b>, а кому-то потребуется <b>полгода</b>.<br />При регулярном посещении и выполнении тренерских указаний ты точно добьёшься поставленной цели!',
                },
                {
                    title: 'А если я пропущу тренировку?',
                    value: 'Система пропусков такая:<br /><br />• пропущенные тренировки <b>на следующий месяц не переносятся</b><br />• пропуски по любым причинам можете отработать с другими группами в <b>этом же месяце</b><br />• в случае отъезда абонемент формируется только на те дни, которые сможет посетить клиент (согласовывается с менеджером <b>до начала и оплаты календарного месяца</b>)<br />• <b>все</b> отработки и форс-мажоры <b>согласовываются с менеджером</b>.',
                },
            ],
        };
    },
    methods: {
        clearString(string) {
            string = string.replace('<b>', '').replace('</b>', '').replace('<br />', ' ');
            return string;
        },
    },
    mounted() {
        this.showText = false;
    },
};
</script>
