<template>
    <div class="container faq">
        <h2 data-aos="fade-right" data-aos-once="true">Часто задаваемые <span class="blue">вопросы</span></h2>
        <client-only>
            <VueFaqAccordion data-aos="fade-up" data-aos-once="true" :items="questions" />
        </client-only>
    </div>
</template>

<script>
import VueFaqAccordion from 'vue-faq-accordion';
import './styles.css';

export default {
    name: 'Team',
    components: {
        VueFaqAccordion,
    },
    data() {
        return {
            showText: true,
            questions: [
                {
                    title: 'Что брать с собой на тренировки?',
                    value: '• <b>плавки/купальник</b> <br />В размер, не на вырост! Чтобы, не дай бог, оно не оказалось на дне бассейна<br /><br />• <b>шапочка</b> <br />Лучше резиновая<br /><br />• <b>очки</b> <br />Обязательно для полного погружения в водный мир<br /><br />• <b>тапочки/сланцы</b> <br />Кроксы также подойдут. Главное, чтобы были в размер и с хорошими протекторами на подошве, чтобы ноги не скользили <br /><br />• <b>полотенце</b> <br />Чтобы не замерзнуть после тренировки и выйти сухим из воды <br /><br />• <b>хорошее настроение</b> <br />Для прохождения фейс контроля! <br /><br />',
                },
                {
                    title: 'Нужна ли справка в бассейн?',
                    value: '• для <b>детей до 12 лет</b> нужны справки педиатр + энтеробиоз <br />• для <b>детей старше 12 лет и взрослых</b> справка о том, что можно посещать бассейн. <br /> <br />Возьмите справку в районной поликлинике или частном медцентре<br /><br />Дешевле и быстрее можно сделать справку у наших друзей – <a href="https://citilab.ru/zelenograd/medcentres/207363/клиники" ><b>СитиЛаб</b></a> по адресу Зеленоград, Георгиевский проспект 37к3. <br />По промокоду <b>SWIMLAB</b> скидка 10% на справки в бассейн”',
                },
                {
                    title: 'Нужно ли отдельно платить за посещение бассейна?',
                    value: 'В групповом формате – <b>нет</b>, аренда бассейна включена в стоимость.<br />На персональные тренировки проход <b>нужно покупать</b> во всех бассейнах, кроме <a href="/zelenograd"><b>Зеленоградского филиала</b></a> в 1801 (там проход уже включен в стоимость).<br/><br />Если же вы хотите поплавать самостоятельно – необходимо оплатить <b>только проход</b>.',
                },
                {
                    title: 'С какого возраста?',
                    value: 'Чем раньше, тем лучше!<br /><br /> • в <a href="/zelenograd" ><b>бассейне Swim Shot</b></a> детки <b>с пяти лет</b> занимаются в группе или персонально <br />Там же <b>на свободное плавание</b> можно <b>с шести лет</b> в сопровождении взрослых, а <b>с 14</b> с письменного согласия родителей. Верхней границы по возрасту в <a href="/zelenograd" ><b>бассейне Swim Shot</b></a> нет!<br /><br />• для мальчишек и девчонок <b>С ДВУХ до шести лет</b> мы проводим тренировки в малом <a href="/orbita" ><b>бассейне СК Орбита</b></a>',
                },
                {
                    title: 'Я боюсь воды. Что делать?',
                    value: 'Скорее приходи к нам на тренировки! <b>Любой страх можно побороть</b>. Главное обратиться к профессионалам.',
                },
                {
                    title: 'Через сколько занятий я/ребенок научимся плавать?',
                    value: 'Мы никогда не отвечаем на этот вопрос, потому что это зависит от многих обстоятельств. Кто-то поплывет через <b>две тренировки</b>, а кому-то потребуется <b>полгода</b>.<br /><br />При регулярном посещении и выполнении тренерских указаний ты точно добьёшься поставленной цели!',
                },
                {
                    title: 'А если я пропущу тренировку?',
                    value: 'Система пропусков такая:<br /><br />• пропущенные тренировки <b>на следующий месяц не переносятся</b><br />• пропуски по любым причинам можете отработать с другими группами в <b>этом же месяце</b>, предупредив менеджера за 12 часов до тренировки<br />• в случае отъезда абонемент формируется только на те дни, которые сможет посетить клиент (согласовывается с менеджером <b>до начала и оплаты календарного месяца</b>)<br />• <b>все</b> отработки и форс-мажоры <b>согласовываются с менеджером</b>.',
                },
                {
                    title: 'Как очищается вода в бассейне?',
                    value: 'Вода <b>обрабатывается</b> ультрафиолетом, хлором, смягчителями хлора и кислотами, поддерживающими <b>оптимальный pH</b>. Роспотребнадзор <b>регулярно</b> проверяет качество воды в нашем бассейне, поэтому за чистоту в Swim Shot не переживай.<br /><br /> Также многие посетители отмечают, что <b>нет запаха хлора</b>, присущего другим бассейнам. У нас его <b>минимум</b>, но отказаться от хлора совсем невозможно, как бы ни хотелось',
                },
            ],
        };
    },
    methods: {
        clearString(string) {
            string = string.replace('<b>', '').replace('</b>', '').replace('<br />', ' ');
            return string;
        },
    },
    mounted() {
        this.showText = false;
    },
};
</script>
