<template>
    <div class="container faq">
        <h2 data-aos="fade-right" data-aos-once="true">Часто задаваемые <span class="blue">вопросы</span></h2>
        <client-only>
            <VueFaqAccordion data-aos="fade-up" data-aos-once="true" :items="questions" />
        </client-only>
        <!-- <template v-if="showText">
            <div v-for="(question, index) in questions" :key="index">
                <p>{{ question.title }}</p>
                <p>{{ clearString(question.value) }}</p>
            </div>
        </template> -->
    </div>
</template>

<script>
import VueFaqAccordion from 'vue-faq-accordion';
import './styles.css';

export default {
    name: 'Team',
    components: {
        VueFaqAccordion,
    },
    data() {
        return {
            showText: true,
            questions: [
                {
                    title: 'Что брать с собой?',
                    value: '• плавки/купальник<br />• шапочка<br />• ‎очки<br />• тапочки<br />• ‎полотенце<br />• <b>‎хорошее настроение</b>',
                },
                {
                    title: 'Нужна ли справка?',
                    value: 'Для персональной тренировки <b>‎справка обязательна</b>. Ее можно получить в районной поликлинике или частном медцентре.<br />Для пробного группового занятия <b>‎справка не понадобится</b>.',
                },
                {
                    title: 'Нужно ли отдельно платить за посещение бассейна?',
                    value: 'В групповом формате – <b>нет</b>, аренда бассейна включена в стоимость.<br />На персональные тренировки проход <b>нужно покупать</b>.',
                },
                {
                    title: 'С какого возраста?',
                    value: 'У нас есть группы для деток <b>от трех лет</b> в Зеленограде и Москве.',
                },
                {
                    title: 'Я боюсь воды. Что делать?',
                    value: 'Скорее приходи к нам на тренировки! <b>Любой страх можно побороть</b>. Главное обратиться к профессионалам.',
                },
                {
                    title: 'Через сколько занятий я/ребенок научимся плавать?',
                    value: 'Мы никогда не отвечаем на этот вопрос, потому что это слишком индивидуальный фактор, зависящий от многих обстоятельств. Кто-то поплывет через <b>две тренировки</b>, а кому-то потребуется <b>полгода занятий</b>.<br />Но при систематическом посещении и выполнении тренерских указаний ты точно добьёшься цели!',
                },
                {
                    title: 'А если я пропущу тренировку?',
                    value: 'Система пропусков такая:<br /><br />• пропущенные тренировки <b>на следующий месяц не переносятся</b><br />• пропуски по любым причинам возможно отработать с другими группами в <b>этом же месяце</b><br />• в случае отъезда абонемент формируется только на те дни, которые сможет посетить клиент (согласовывается с менеджером <b>до начала и оплаты календарного месяца</b>)<br />• <b>все</b> отработки и форс-мажоры <b>согласовываются с менеджером</b>.',
                },
            ],
        };
    },
    methods: {
        clearString(string) {
            string = string.replace('<b>', '').replace('</b>', '').replace('<br />', ' ');
            return string;
        },
    },
    mounted() {
        this.showText = false;
    },
};
</script>
